{
    "name": "Git",
    "icon": "GitIcon",
    "description": "Git helps you keep track of changes in your files and work with others on the same project.",
    "snippets": [
        {
            "title": "Install Git (Windows)",
            "codeDes": "Download Git from the official website (https://git-scm.com/) and follow the installation instructions. After installation, open Command Prompt and run the following command to verify the installation.",
            "code": "git --version",
            "language": "bash"
        },
        {
            "title": "Install Git (Mac)",
            "codeDes": "Install Git using Homebrew, a package manager for macOS. Open Terminal and run the following commands to install Git and verify the installation.",
            "code": "brew install git\ngit --version",
            "language": "bash"
        },
        {
            "title": "Install Git (Linux)",
            "codeDes": "Install Git using your Linux distribution's package manager. Use the appropriate command for your system (e.g., apt for Ubuntu/Debian, yum for RedHat/CentOS). After installation, run the following command to verify the installation.",
            "code": "sudo apt install git  # Ubuntu/Debian\nsudo yum install git  # RedHat/CentOS\ngit --version",
            "language": "bash"
        },
        {
            "title": "Set Up Git Username and Email",
            "codeDes": "Configure Git with your name and email address, which will be used to label your commits. Replace 'Your Name' and 'your-email@example.com' with your actual name and email address.",
            "code": "git config --global user.name \"Your Name\"\ngit config --global user.email \"your-email@example.com\"",
            "language": "bash"
        },
        {
            "title": "Check Git Settings",
            "codeDes": "Display your current Git configuration settings, including your username and email address, to ensure they are set correctly.",
            "code": "git config --global --list",
            "language": "bash"
        },
        {
            "title": "Create SSH Key",
            "codeDes": "Generate a new SSH key pair for secure authentication with GitHub. Replace 'your-email@example.com' with your email address. Follow the prompts to save the key and optionally set a passphrase.",
            "code": "ssh-keygen -t rsa -b 4096 -C \"your-email@example.com\"",
            "language": "bash"
        },
        {
            "title": "Add SSH Key to GitHub",
            "codeDes": "Display the contents of your public SSH key file. Copy the output and add it to your GitHub account under Settings > SSH and GPG keys.",
            "code": "cat ~/.ssh/id_rsa.pub",
            "language": "bash"
        },
        {
            "title": "Test SSH Connection",
            "codeDes": "Test your SSH connection to GitHub to ensure your SSH key is set up correctly. You should see a success message indicating that you have successfully authenticated.",
            "code": "ssh -T git@github.com",
            "language": "bash"
        },
        {
            "title": "Start a New Git Project",
            "codeDes": "Initialize a new Git repository in your current directory. This will create a .git directory and start tracking changes in your project.",
            "code": "git init",
            "language": "bash"
        },
        {
            "title": "Check Project Status",
            "codeDes": "Display the status of your working directory and staging area, showing which files have been modified, added, or deleted.",
            "code": "git status",
            "language": "bash"
        },
        {
            "title": "Save a File for Commit",
            "codeDes": "Stage a specific file for commit, adding it to the list of changes to be saved. Replace 'filename.txt' with the name of the file you want to stage.",
            "code": "git add filename.txt",
            "language": "bash"
        },
        {
            "title": "Save All Changes",
            "codeDes": "Stage all modified and new files in your working directory for commit, adding them to the list of changes to be saved.",
            "code": "git add .",
            "language": "bash"
        },
        {
            "title": "Commit Your Changes",
            "codeDes": "Commit the staged changes to your repository with a descriptive message explaining what you did. Replace 'Initial commit' with your own message.",
            "code": "git commit -m \"Initial commit\"",
            "language": "bash"
        },
        {
            "title": "See Commit History",
            "codeDes": "Display a concise list of all commits in your repository, showing the commit hash and message for each commit.",
            "code": "git log --oneline",
            "language": "bash"
        },
        {
            "title": "Link to GitHub",
            "codeDes": "Add a remote repository on GitHub to your local Git repository. Replace 'https://github.com/your-username/your-repo.git' with the URL of your GitHub repository.",
            "code": "git remote add origin https://github.com/your-username/your-repo.git",
            "language": "bash"
        },
        {
            "title": "Upload Changes to GitHub",
            "codeDes": "Push your committed changes to the remote repository on GitHub. The '-u' flag sets 'origin main' as the default upstream branch for future pushes.",
            "code": "git branch -M main\ngit push -u origin main",
            "language": "bash"
        },
        {
            "title": "Download a Project",
            "codeDes": "Clone a GitHub repository to your local machine, creating a copy of the repository in a new directory. Replace 'https://github.com/your-username/your-repo.git' with the URL of the repository you want to clone.",
            "code": "git clone https://github.com/your-username/your-repo.git",
            "language": "bash"
        },
        {
            "title": "Get Latest Changes",
            "codeDes": "Fetch and merge the latest changes from the remote repository on GitHub into your local repository. This updates your local project with any new commits from the 'main' branch.",
            "code": "git pull origin main",
            "language": "bash"
        }
    ]
}